{
    "jobs": {
        "Admin Assistant": {
            "jobdesc": "We are looking for a responsible Administrative Assistant to perform a variety of administrative and clerical tasks. Duties of the Administrative Assistant include providing support to our managers and employees, assisting in daily office needs and managing our company’s general administrative activities.",
            "qualifications": [
                "Proven experience as an Administrative Assistant, Virtual Assistant or Office Admin Assistant",
                "Knowledge of office management systems and procedures",
                "Working knowledge of office equipment, like printers and fax machines",
                "Proficiency in MS Office (MS Excel and MS PowerPoint, in particular)",
                "Excellent time management skills and the ability to prioritize work",
                "Attention to detail and problem solving skills",
                "Excellent written and verbal communication skills",
                "Strong organizational skills with the ability to multi-task",
                "High School degree; additional qualification as an Administrative assistant or Secretary will be a plus"
            ],
            "disability": [
                "Wheelchair Accessible: Yes",
                "Suitable For: Physical, Motor, Hearing, Visual, Autism, Intellectual Disabilities",
                "Available Assistive Technologies: Wheelchair, Rollator, Guiderails, Guidesticks",
                "Employee Insurance: Available",
                "Transport to Workplace: Provided",
                "Disability Support Staff: Available"
            ]
        },
        "HR Staff": {
            "jobdesc": "We are looking for HR Staff to undertake a variety of HR administrative duties. The HR Staff duties involve a wide range of support activities inside our HR department, from coordinating meetings to maintaining our employee database to posting job ads. An important part of your role will be to act as the liaison between HR and employees, ensuring smooth communication and prompt resolution of requests and questions. You’ll also assist in creating policies, processes and documents.",
            "qualifications": [
                "Proven experience as an HR Assistant, Staff Assistant or relevant human resources/administrative position",
                "Fast computer typing skills (MS Office, in particular)",
                "Hands-on experience with an HRIS or HRMS",
                "Familiarity with ATS software and resume databases",
                "Basic knowledge of labor laws",
                "Excellent organizational skills",
                "Strong communications skills",
                "Degree in Human Resources or related field"
            ],
            "disability": [
                "Wheelchair Accessible: Yes",
                "Suitable For: Physical, Motor, Hearing, Visual, Autism, Intellectual Disabilities",
                "Available Assistive Technologies: Wheelchair, Rollator, Guiderails, Guidesticks",
                "Employee Insurance: Available",
                "Transport to Workplace: Provided",
                "Disability Support Staff: Available"
            ]
        },
        "Research Assistant": {
            "jobdesc": "We are seeking a passionate, detail-oriented Research Assistant to aid our project by preparing interviews and summarizing results. You will also work with undergraduate students on the team who can help bring your expertise into their papers as they complete them for publication in top academic journals. \nUltimately, you will be responsible for managing multiple tasks, but understand when one is more important than another to complete it on time.",
            "qualifications": [
                "Proven work experience as a Research Assistant or similar role",
                "Excellent administrative skills",
                "Knowledge of research methods",
                "Ability to work under pressure",
                "Excellent time management skills",
                "A degree in the field related to the study is preferred"
            ],
            "disability": [
                "Wheelchair Accessible: Yes",
                "Suitable For: Physical, Motor, Hearing, Visual, Autism, Intellectual Disabilities",
                "Available Assistive Technologies: Wheelchair, Rollator, Guiderails, Guidesticks",
                "Employee Insurance: Available",
                "Transport to Workplace: Provided",
                "Disability Support Staff: Available"
            ]
        },
        "Personal Assistant": {
            "jobdesc": "We are looking for a responsible Personal Assistant to provide personalized secretarial and administrative support in a well-organized and timely manner. You will work on a one-to-one basis on a variety of tasks related to manager’s working life and communication. Responsibilities include acting as the point of contact between manager and internal/external clients, screening and directing phone calls and distributing correspondence, handling requests and queries approproately, and sourcing office supplies.",
            "qualifications": [
                "Proven work experience as a Personal Assistant",
                "Knowledge of office management systems and procedures",
                "MS Office and English proficiency",
                "Outstanding organisational and time management skills",
                "Up-to-date with latest office gadgets and applications",
                "Ability to multitask and prioritize daily workload",
                "Excellent verbal and written communications skills",
                "Discretion and confidentiality",
                "High School degree",
                "PA diploma or certification would be considered an advantage"
            ],
            "disability": [
                "Wheelchair Accessible: Yes",
                "Suitable For: Physical, Motor, Hearing, Visual, Autism, Intellectual Disabilities",
                "Available Assistive Technologies: Wheelchair, Rollator, Guiderails, Guidesticks",
                "Employee Insurance: Available",
                "Transport to Workplace: Provided",
                "Disability Support Staff: Available"
            ]
        },
        "Flyer Distributer": {
            "jobdesc": "We are looking for a driven Flyer Distributer to hand out flyers to promote events, venues, or establishments. Duties include handing out flyers to the general public at strategically chosen locations, distributing flyers through residential front doors or to businesses, having an in depth knowledge of the information they are handing out and be a point of information for people with queries, being enthusiastic about the event or establishment they are promoting and covering as many people/houses as they can in order to market as widely as possible.",
            "qualifications": [
                "be enthusiastic and polite",
                "be able to handle public confrontation effectively and calmly to diffuse potentially difficult situations",
                "speak English to a high standard",
                "have the capacity to remember information regarding their promotion and be able to answer questions eloquently",
                "be able to work in teams to calculate the most efficient way to cover ground",
                "be prepared to work outside in all types of weather",
                "persevere despite set backs or rejections",
                "be physically fit in regards to delivery door to door",
                "be confident and assertive"
            ],
            "disability": [
                "Wheelchair Accessible: No",
                "Suitable For: Physical, Hearing, Autism, Intellectual Disabilities",
                "Available Assistive Technologies: Guiderails",
                "Employee Insurance: Available",
                "Transport to Workplace: Provided",
                "Disability Support Staff: Available"
            ]
        },
        "Mailman": {
            "jobdesc": "We are looking for a hardworking and passionate Mailman to deliver letters, documents and parcels to businesses and homes. Responsibilities include travelling planned routes on foot or by truck, collecting outgoing mail along route, and when necessary, collects money for postage due, sorting mail, including packages, according to delivery sequence, loading sacks and boxes filled with mail onto and off mail truck, maintaining logs to monitor delivery rates and vehicle maintenance scheduling, and Obtains signatures on registered, insured, and certified mail.",
            "qualifications": [
                "Organizational skills",
                "Attention to detail",
                "Efficiency",
                "Physical stamina and strength",
                "Integrity and respect for confidentiality and privacy",
                "Ability to read and understand English with high degree of proficiency",
                "Good communication, interpersonal, and customer service skills",
                "Depending on route, must be able to lift and carry heavy sacks of mail and walk long distances"
            ],
            "disability": [
                "Wheelchair Accessible: No",
                "Suitable For: Physical, Hearing, Autism, Intellectual Disabilities",
                "Available Assistive Technologies: Guiderails",
                "Employee Insurance: Available",
                "Transport to Workplace: Provided",
                "Disability Support Staff: Available"
            ]
        },
        "Delivery Staff": {
            "jobdesc": "We are looking for a responsible Delivery Staff to distribute products promptly to our customers. You will represent our company in a professional and cost-effective manner to increase our profitability and customer satisfaction. Responsibilites include delivering a wide variety of items to different addresses and through different routes, following routes and time schedule, loading, unloading, preparing, inspecting and operating a delivery vehicle.",
            "qualifications": [
                "Proven working experience as a Delivery Driver",
                "Valid professional driver’s license",
                "Ability to operate forklifts and tractors in a variety of weather and traffic conditions",
                "Excellent organizational and time management skills",
                "Good driving record with no traffic violations",
                "High school degree"
            ],
            "disability": [
                "Wheelchair Accessible: No",
                "Suitable For: Physical, Hearing, Autism, Intellectual Disabilities",
                "Available Assistive Technologies: Guiderails",
                "Employee Insurance: Available",
                "Transport to Workplace: Provided",
                "Disability Support Staff: Available"
            ]
        },
        "Delivery Personnel": {
            "jobdesc": "We are looking for a reliable delivery driver who is concerned with customer satisfaction and transporting items in a safe, timely manner. The delivery driver will pick up and drop off items while adhering to assigned routes and time schedules. You should be willing to work as part of the delivery team in order to ensure that the items are complete, packed correctly, and safely delivered to the correct client.\nTo succeed as a delivery driver, you should be polite and prompt with a commitment to providing our clients with an excellent experience. You should be thorough in ensuring orders are properly fulfilled, committed to work safety, and passionate about satisfying clients.",
            "qualifications": [
                "High school diploma or equivalent.",
                "Valid driver's license issued by the state where you intend to work.",
                "Clean driving record.",
                "Special licenses may be required to operate certain vehicles.",
                "Experience may be required or preferred.",
                "Willingness to adhere to assigned routes, schedules, safety procedures, and transportation laws.",
                "Strong time management and customer service skills.",
                "Ability to walk, drive, and lift and carry heavy items for extended periods.",
                "Attention to detail."
            ],
            "disability": [
                "Wheelchair Accessible: No",
                "Suitable For: Physical, Hearing, Autism, Intellectual Disabilities",
                "Available Assistive Technologies: Guiderails",
                "Employee Insurance: Available",
                "Transport to Workplace: Provided",
                "Disability Support Staff: Available"
            ]
        },
        "Truck Driver": {
            "jobdesc": "We are looking for an experienced Truck Driver to serve our supply chain logistics department in a safe and timely manner. Responsibilities include transporting finished goods and raw materials over land to and from manufacturing plants or retail and distribution centers, inspecting vehicles for mechanical items and safety issues and perform preventative maintenance, planning routes and meeting delivery schedules",
            "qualifications": [
                "Proven work experience as a Truck Driver",
                "Hands on experience with electronic equipment and software (GPS, AVL units, CB etc)",
                "Ability to drive long hours and travel regularly",
                "Extensive knowledge of applicable truck driving rules and regulations",
                "No recent moving or driving violations",
                "Adaptability and foresight to handle unexpected situations (traffic, weather conditions etc)",
                "Willing to submit to background/drug checks and provide employment recommendations",
                "Trucking school diploma",
                "Valid truck driving licence"
            ],
            "disability": [
                "Wheelchair Accessible: No",
                "Suitable For: Physical, Hearing, Autism, Intellectual Disabilities",
                "Available Assistive Technologies: Guiderails",
                "Employee Insurance: Available",
                "Transport to Workplace: Provided",
                "Disability Support Staff: Available"
            ]
        }
    }
}